Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
    // Configure USART2 Tx (PA.02) as alternate function push-pull
    GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStructure);
    
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2); 
	
    // Enable the USART2 Interrupt
    NVIC_InitStructure.NVIC_IRQChannel = USART2_IRQChannel;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);    
	
	USART_DeInit(USART2);
    
    USART_InitStructure.USART_BaudRate = bound;                
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx; 
    
    USART_Init(USART2, &USART_InitStructure);
    USART_ITConfig(USART2, USART_IT_RXNE, ENABLE);
    // Enable USART2
    USART_Cmd(USART2, ENABLE);
	
}

void BufInit(void)
{
	memset(IPDNum, 0, sizeof(IPDNum));
	memset(INADDR_ANY, 0, sizeof(INADDR_ANY));
	memset(msg, 0, sizeof(msg));
	memset(u16data, 0, sizeof(u16data));
	memset(usart_wifi_buf, 0, sizeof(usart_wifi_buf));
	memset(SrvBuf, 0, sizeof(SrvBuf));
}

void SocketInit(void)
{
	uint32_t i;
	
	// BC_MAX_SOCKET_NUM == 5;
	for(i = 0; i < BC_MAX_SOCKET_NUM; i++) {
		memset(&sock_data[i], 0, sizeof(BC_SocketData));
	}
	sock_data[0].buf = SockBuf_0;
	sock_data[1].buf = SockBuf_1;
	sock_data[2].buf = SockBuf_2;
	sock_data[3].buf = SockBuf_3;
	sock_data[4].buf = SockBuf_4;

	sock_data[0].queue_handle = xQueue0;
	sock_data[1].queue_handle = xQueue1;
	sock_data[2].queue_handle = xQueue2;
	sock_data[3].queue_handle = xQueue3;
	sock_data[4].queue_handle = xQueue4;
}

sint32_t BC_QueueInit(void)
{
	sint32_t result = BC_OK;
	uint32_t i = 0;
	
	if(!(xQueue0 = xQueueCreate(1, sizeof(BC_SocketData)))) result = BC_ERR;
	if(!(xQueue1 = xQueueCreate(1, sizeof(BC_SocketData)))) result = BC_ERR;
	if(!(xQueue2 = xQueueCreate(1, sizeof(BC_SocketData)))) result = BC_ERR;
	if(!(xQueue3 = xQueueCreate(1, sizeof(BC_SocketData)))) result = BC_ERR;
	if(!(xQueue4 = xQueueCreate(1, sizeof(BC_SocketData)))) result = BC_ERR;

	for(i = 0; i < MAX_CLI_QUEUE; i++) {
		if(!(xQueueCli[i] = xQueueCreate(1, sizeof(BC_SocketData)))) result = BC_ERR;
	}
	
	return result;
}

sint32_t BC_MutexInit(void)
{
	sint32_t result = BC_OK;
	sint32_t f = 0;
	int i;
	
	if(!(xMutexWifiStateFlag = xSemaphoreCreateBinary())) 	result = BC_ERR;
	// if(result != BC_OK) {
	// 	while(1) {
	// 		for(i=0; i < 10000; i++)
	// 			;
	// 		sprintf(msg, "MutexInit Error1\r\n");
	// 		uputs(USART_TERMINAL, msg);
	// 	}

	// }
	if(!(xMutexRecvFlag = xSemaphoreCreateBinary())) 		result = BC_ERR;
	if(result != BC_OK) {
		while(1) {
			for(i=0; i < 10000; i++)
				;
			sprintf(msg, "MutexInit Error2\r\n");
			uputs(USART_TERMINAL, msg);
		}

	}
	f = SET_START_RECV_FLAG(WIFI_USART_STATE_INIT);
	if(f < 0) {
		while(1) {
			for(i=0; i < 10000; i++)
				;
			sprintf(msg, "MutexInit Error3:%d\r\n", f);
			uputs(USART_TERMINAL, msg);
		}
	}

	return result;
}

volatile void xUSART2_IRQHandler(void)
{	
	static uint32_t Index = 0;
	static uint16_t RxData=0;
	static sint32_t u32CurrentSockId = -1;
	BC_SocketData sock_data_tmp;
	BaseType_t xHigherPriorityTaskWoken;

	if(USART_GetITStatus(USART_WIFI, USART_IT_RXNE) == RESET) {
		return;
	}
	RxData = USART_RECEIVE(USART_WIFI, RxData);

	usart_wifi_buf[Index++] = (uint8_t)RxData;
	if('\r' == usart_wifi_buf[0] || '\n' == usart_wifi_buf[0]) {
		Index = 0;
		return;
	}
	if(Index >= WIFI_BUF_SIZE - 1) {
		WifiRecvFlag |= WIFI_MSG_FLAG_BUF_OVERFLOW;
		usart_wifi_buf[WIFI_BUF_SIZE-1] = '\0';
		Index = 0;
		return;
	}
	if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_OK_END, WIFI_FLAG_OK_END_SIZE, TRUE)) {
		WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_OK;
		Index = 0;
		return;
	}
	if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_ERROR_END, WIFI_FLAG_ERROR_END_SIZE, TRUE)) {
		WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_ERR;
		usart_wifi_buf[Index] = '\0';
		Index = 0;
		return;
	}

	// client connects to local server
	if(Index >= 1) {
		if(isdigit(usart_wifi_buf[0])) {
			u32CurrentSockId = BC_Atoi(usart_wifi_buf[0]);
			if(u32CurrentSockId != 0) {
				return;
			}
			if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_CONN_END, WIFI_FLAG_CONN_END_SIZE, TRUE) && (WifiRecvFlag & WIFI_MSG_FLAG_GOT_CONNECT) == 0) {
				if(pdTRUE != xQueueSendFromISR(xQueue0, &sock_data[u32CurrentSockId], &xHigherPriorityTaskWoken)) {
					sprintf(msg_irs, "CONN QUE Err\r\n");
				} else {
					sprintf(msg_irs, "CONN QUE OK\r\n");
					WifiRecvFlag |= WIFI_MSG_FLAG_GOT_CONNECT;
				}
				Index = 0;
				return;
			}
			if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_CLOSED_END, WIFI_FLAG_CLOSED_END_SIZE, TRUE)) {
				// sock_data[u32CurrentSockId].msg_flag |= WIFI_MSG_FLAG_GOT_CLOSED;
				WifiRecvFlag |= WIFI_MSG_FLAG_GOT_CLOSED;
				Index = 0;
				return;
			}
		}
	}

	if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_STATUS_ST, WIFI_FLAG_STATUS_ST_SIZE, FALSE) && (WifiRecvFlag & WIFI_MSG_FLAG_GOT_CLI) == 0) {
		if(ParseCIPSTATUS(usart_wifi_buf+WIFI_FLAG_STATUS_ST_SIZE, Index-WIFI_FLAG_STATUS_ST_SIZE, &sock_data_tmp) == 0) {
			if(pdTRUE != xQueueSendFromISR(xQueue0, &sock_data_tmp, &xHigherPriorityTaskWoken)) {
				// sprintf(msg_irs, "STATUS QUE Err\r\n");
			} else {
				// sprintf(msg_irs, "STATUS QUE OK\r\n");
				WifiRecvFlag |= WIFI_MSG_FLAG_GOT_CLI;
			}
			return;
		}
	}
	if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_IPD_ST, WIFI_FLAG_IPD_ST_SIZE, FALSE) && (WifiRecvFlag & WIFI_MSG_FLAG_GOT_IPD) == 0) {
		if(ParseIPD(usart_wifi_buf, Index, &sock_data[0]) == 0) {
			if(pdTRUE != xQueueSendFromISR(xQueue0, &sock_data[0], &xHigherPriorityTaskWoken)) {
				sprintf(msg_irs, "IPD QUE Err\r\n");
			} else {
				sprintf(msg_irs, "IPD QUE OK\r\n");
				WifiRecvFlag |= WIFI_MSG_FLAG_GOT_IPD;
			}
			Index = 0;
			return;
		}
	}
}

// volatile void xUSART2_IRQHandler(void)
// {	
// 	static uint32_t Index = 0;
// 	static uint16_t u16PackSize = 0;
// 	static uint32_t IPDState = IPD_STATE_START_PROBE;
// 	static uint16_t num = 0;
// 	static uint8_t i = 0;
// 	static uint16_t FirstComma = 0, SecondComma = 0, Colon = 0;
// 	static uint16_t RxData=0;
// 	static uint16_t u16SocketID = 0;
// 	static sint32_t u32CurrentSockId = -1;
// 	static uint32_t StartRecvFlagTmp = 0;
// 	uint32_t u32Tmp = 0;
// 	BC_SocketData sock_data_tmp;
// 	BaseType_t xHigherPriorityTaskWoken;
// 	
// 	// sprintf(msg_irs, "InUsart2\r\n");
// 	if(USART_GetITStatus(USART_WIFI, USART_IT_RXNE) == RESET) {
// 		return;
// 	}
// 	RxData = USART_RECEIVE(USART_WIFI, RxData);
// 	// i = (char)(0xFF & RxData);
// 	// sprintf(u16data, "%02x ", i);
// 	// uputs(USART_TERMINAL, u16data);
// 	// i = 0;
// 	// return;
// 	// if(GET_START_RECV_FLAG_ISR(&StartRecvFlagTmp) < 0) {
// 	// 	return;
// 	// }
// 	
// 	if(GET_WIFI_USART_STATE() == WIFI_USART_STATE_RUNNING) {
// 		usart_wifi_buf[Index++] = (uint8_t)RxData;
// 		if(Index >= WIFI_BUF_SIZE - 1) {
// 			// StartReceiveFlag = 0;
// 			// SET_WIFI_USART_STATE(WIFI_MSG_FLAG_BUF_OVERFLOW);
// 			IPDState = IPD_STATE_START_PROBE;
// 			usart_wifi_buf[WIFI_BUF_SIZE-1] = '\0';
// 			Index = 0;
// 			return;
// 		}
// 		// IPD PACKET
// 		switch(IPDState) {
// 			case IPD_STATE_START_PROBE:
// 				if('+' == usart_wifi_buf[0]) {
// 					IPDState = IPD_STATE_HANDLE_HEADER;
// 				}
// 				break;
// 				// Not return, 
// 				// because we don't know whether it's an another packet type
// 			case IPD_STATE_HANDLE_HEADER:
// 				if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_IPD_ST, WIFI_FLAG_IPD_ST_SIZE, FALSE)) {
// 					IPDState = IPD_STATE_HANDLE_SOCKET_ID;
// 				}
// 				// Not return, 
// 				// because we don't know whether it's an another packet type
// 				break;
// 			case IPD_STATE_HANDLE_SOCKET_ID:
// 				if(Index <= 4) {
// 					// retrive the previous state
// 					IPDState = IPD_STATE_START_PROBE;
// 					break;
// 				}
// 				FirstComma = 0;
// 				SecondComma = 0;
// 				for(i = 4; i < Index; i++) {
// 					if(',' == usart_wifi_buf[i] && 0 == FirstComma) {
// 						FirstComma = i;
// 					}
// 					else if(',' == usart_wifi_buf[i] && FirstComma != 0) {
// 						SecondComma = i;
// 						break;
// 					}
// 				}
// 				if(0 == FirstComma || 0 == SecondComma) {
// 					return;
// 				}
// 				u32Tmp = SecondComma-FirstComma-1; // number of digit
// 				if(u32Tmp> NUM_ASCII_SIZE - 1) {  // "-1" for '\0'
// 					IPDState = IPD_STATE_START_PROBE;
// 					break;
// 				}
// 				memcpy((void *)IPDNum, (void *)usart_wifi_buf[FirstComma+1], u32Tmp);
// 				IPDNum[u32Tmp] = '\0';
// 				u32Tmp = atoi(IPDNum);
// 				if(u32Tmp < 0 || u32Tmp > 4) {
// 					// out of range
// 					IPDState = IPD_STATE_START_PROBE;
// 					break;
// 				}
// 				// u16SocketID = u32Tmp;
// 				u32CurrentSockId = u32Tmp;
// 				IPDState = IPD_STATE_HANDLE_SIZE;
// 				return;
// 				break; // never come here
// 			case IPD_STATE_HANDLE_SIZE:
// 				Colon = 0;
// 				SecondComma = 0;
// 				for(i = Index - 1; i > 4; i--) {
// 					if(';' == usart_wifi_buf[i] && 0 == Colon) {
// 						Colon = i;
// 					}
// 					else if(',' == usart_wifi_buf[i] && Colon != 0) {
// 						SecondComma = i;
// 						break;
// 					}
// 				}
// 				if(0 == Colon || 0 == SecondComma) {
// 					return;
// 				}
// 				u32Tmp = Colon - SecondComma - 1; // number of digit
// 				if(u32Tmp> NUM_ASCII_SIZE - 1) {  // "-1" for '\0'
// 					IPDState = IPD_STATE_START_PROBE;
// 					break;
// 				}
// 				memcpy((void *)IPDNum, (void *)&usart_wifi_buf[SecondComma+1], u32Tmp);
// 				IPDNum[u32Tmp] = '\0';
// 				u32Tmp = atoi(IPDNum);
// 				if(u32Tmp > 5000) {  // max msg size 5000(temporarily 5000)
// 					// out of range
// 					IPDState = IPD_STATE_START_PROBE;
// 					break;
// 				}
// 				u16PackSize = u32Tmp;
// 				IPDState = IPD_STATE_HANDLE_CONTENT;
// 				return;
// 				break; // never come here
// 			case IPD_STATE_HANDLE_CONTENT:
// 				if(Index > Colon + u16PackSize) {
// 					IPDState = IPD_STATE_COMPLETED;
// 				} else {
// 					return;
// 					break; // never come here
// 				}
// 				// no break here
// 			case IPD_STATE_COMPLETED:
// 				// TODO:
// 				// handle \r\n left;
// 				if(u16PackSize > SOCKET_BUF_SIZE) {
// 					IPDState = IPD_STATE_START_PROBE;
// 				} else if(u16SocketID > 4) {
// 					IPDState = IPD_STATE_START_PROBE;
// 				} else {
// 					if(usart_wifi_buf[Index-1] == '\n' && usart_wifi_buf[Index-2] == '\r') {
// 						memcpy(sock_data[u32CurrentSockId].buf, &usart_wifi_buf[Colon+1], u16PackSize);
// 						IPDState = IPD_STATE_START_PROBE;
// 					}
// 				}
// 				
// 				return;
// 			default:
// 				IPDState = IPD_STATE_START_PROBE;
// 				break;
// 		}
// 		
// 		// client connects to local server
// 		if(Index >= 1) {
// 			if(isdigit(usart_wifi_buf[0])) {
// 				u32CurrentSockId = BC_Atoi(usart_wifi_buf[0]);
// 				if(u32CurrentSockId != 0) {
// 					return;
// 				}
// 				if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_CONN_END, WIFI_FLAG_CONN_END_SIZE, TRUE)) {
// 					sock_data[u32CurrentSockId].msg_flag |= WIFI_MSG_FLAG_GOT_CONNECT;
// 					xQueueSendFromISR(xQueue0, &sock_data[u32CurrentSockId], &xHigherPriorityTaskWoken);
// 					Index = 0;
// 					return;
// 				}
// 				if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_CLOSED_END, WIFI_FLAG_CLOSED_END_SIZE, TRUE)) {
// 					sock_data[u32CurrentSockId].msg_flag |= WIFI_MSG_FLAG_GOT_CLOSED;
// 					Index = 0;
// 					return;
// 				}
// 			}
// 		}
// 
// 		if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_STATUS_ST, WIFI_FLAG_STATUS_ST_SIZE, FALSE)) {
// 			// sprintf(msg_irs, "CheckSTOK\r\n");
// 			if(ParseCIPSTATUS(usart_wifi_buf, Index, &sock_data_tmp) == 0) {
// 				xQueueSendFromISR(xQueue0, &sock_data_tmp, &xHigherPriorityTaskWoken);
// 				Index = 0;
// 				return;
// 			}
// 		}
// 
// 		if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_OK_END, WIFI_FLAG_OK_END_SIZE, TRUE)) {
// 			usart_wifi_buf[Index] = '\0';
// 			WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_OK;
// 			Index = 0;
// 			return;
// 		}
// 		if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_ERROR_END, WIFI_FLAG_ERROR_END_SIZE, TRUE)) {
// 			usart_wifi_buf[Index] = '\0';
// 			WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_ERR;
// 			Index = 0;
// 			return;
// 		}
// 	} else if(GET_WIFI_USART_STATE() == WIFI_USART_STATE_INIT) {
// 		usart_wifi_buf[Index++] = (uint8_t)RxData;
// 		if(Index >= WIFI_BUF_SIZE - 1) {
// 			// StartReceiveFlag = 0;
// 			WifiRecvFlag |= WIFI_MSG_FLAG_BUF_OVERFLOW;
// 			IPDState = IPD_STATE_START_PROBE;
// 			usart_wifi_buf[WIFI_BUF_SIZE-1] = '\0';
// 			Index = 0;
// 			return;
// 		}
// 		if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_OK_END, WIFI_FLAG_OK_END_SIZE, TRUE)) {
// 			usart_wifi_buf[Index] = '\0';
// 			WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_OK;
// 			Index = 0;
// 			return;
// 		}
// 		if(BC_OK == CheckWifiData(usart_wifi_buf, Index, WIFI_FLAG_ERROR_END, WIFI_FLAG_ERROR_END_SIZE, TRUE)) {
// 			usart_wifi_buf[Index] = '\0';
// 			WifiRecvFlag |= WIFI_MSG_FLAG_GENERAL_ERR;
// 			Index = 0;
// 			return;
// 		}
// 	}
// 	return;
// }

volatile void HardFault_Handler(void)
{
	sprintf(msg, "HardFault:%x\r\n", *HFSR);
	sprintf(msg+strlen(msg), "MemManage:%x\r\n", *MFSR);
	sprintf(msg+strlen(msg), "BusFault:%x\r\n", *BFSR);
	sprintf(msg+strlen(msg), "BFAR:%x\r\n", *BFAR);
	sprintf(msg+strlen(msg), "UsageFault:%x\r\n", *UFSR);
	uputs(USART1, msg);
	for(;;);
}

volatile void MemManage_Handler(void)
{

