Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
	sprintf(msg, "MemManage:%x\r\n", *MFSR);
	uputs(USART1, msg);
	for(;;);
}

volatile void BusFault_Handler(void)
{

	sprintf(msg, "BusFault:%x\r\n", *BFSR);
	sprintf(msg+strlen(msg), "BFAR:%x\r\n", *BFAR);
	uputs(USART1, msg);
	for(;;);
}

volatile void UsageFault_Handler(void)
{

	sprintf(msg, "UsageFault:%x\r\n", *UFSR);
	uputs(USART1, msg);
	for(;;);
}

volatile void vUARTInterruptHandler( void )
{
	uint16_t RxData = 0;
	if(USART_GetITStatus(USART1, USART_IT_RXNE) == RESET) {
		return;
	}
	USART_RECEIVE(USART1, RxData);
	xxx = (sint8_t)RxData;
}

sint32_t uputs(USART_TypeDef * usart, sint8_t * str)
{
	if(!usart || !str) {
		return -1;
	}
	if('\0' == *str) {
		return 0;
	}
	do {
		// 检测发送完成TC标志。
		// 为了提高函数效率，此处没有使用库函数USART_GetITStatus
		// while((usart->SR&0X40)==0)
		//	;
		// USART_SEND(usart, *str++);
		USART_SendData(usart,*str++);
		//delay_ms(1);
		while(USART_GetFlagStatus(usart,USART_FLAG_TC)!=SET);//等待发送结束
	}while('\0' != *str);
	
	return 0;
}

void vLedTask(void *pvParameters)
{
	int xxx_old;
	TickType_t ms = 500;
	int init;
	

	xxx = 'a';
	xxx_old = xxx;
	msg_irs[0] = '\0';

	while(1) {
		
		vTaskDelay(ms);
		LED2TURN();
		
		if(xxx != xxx_old) {
			xxx_old = xxx;
		}
		if(xxx == 'w') {
			if(init == 0) {
				init = 1;
				uputs(USART1, "Start WifiInit\r\n");
				BC_WifiInit();
			}
			vTaskDelay(ms);
			vTaskDelay(ms);
			printf("isr: %s\r\n", msg_irs);
			printf("ust: %s\r\n", usart_wifi_buf);
		} else {
			init = 0;
			sprintf(msg, "Ansersion: %c\r\n", xxx);
			uputs(USART1, msg);
			// sprintf(msg, "Ansersion2: %c\r\n", xxx);
			// uputs(USART2, msg);
		}
		
	}
}

sint32_t BC_WifiInit(void)
{
	int i = 0;
	// char * str_pos = NULL;
	TickType_t delay_time_ms = 2000;
	uint8_t * tmp_ptr = NULL;
	
	// StartAcceptFlag = 0;
	// StartReceiveFlag = 0;

	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+RST\r\n");
		vTaskDelay(delay_time_ms);
		sprintf(msg, "WifiRecvFlag: %02x\r\n", WifiRecvFlag);
		uputs(USART_TERMINAL, msg);
		uputs(USART_TERMINAL, usart_wifi_buf);
		usart_wifi_buf[0] = '\0';
		uputs(USART_TERMINAL, "AT+RST...\r\n");
	}
	uputs(USART_TERMINAL, "AT+RST: OK\r\n");
	memset(usart_wifi_buf, 0, WIFI_BUF_SIZE);
	WifiRecvFlag = 0;

	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+CWMODE=1\r\n");
		vTaskDelay(delay_time_ms);
		uputs(USART_TERMINAL, "\r\n");
		uputs(USART_TERMINAL, usart_wifi_buf);
		uputs(USART_TERMINAL, "\r\n");
		
		uputs(USART_TERMINAL, "AT+CWMODE=1...\r\n");
	}
	uputs(USART_TERMINAL, "AT+CWMODE=1: OK\r\n");
	memset(usart_wifi_buf, 0, WIFI_BUF_SIZE);
	WifiRecvFlag = 0;
	
	// SER WIFI SSID AND PASSWORD
	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+CWJAP=\"hb402-2g\",\"68704824\"\r\n");
		vTaskDelay(delay_time_ms);
		sprintf(msg, "WifiRecvFlag: %02x\r\n", WifiRecvFlag);
		uputs(USART_TERMINAL, msg);
		uputs(USART_TERMINAL, usart_wifi_buf);
		usart_wifi_buf[0] = '\0';
		uputs(USART_TERMINAL, "AT+CWJAP=\"hb402-2g\",\"68704824\"...\r\n");
	}
	uputs(USART_TERMINAL, "AT+CWJAP=\"hb402-2g\",\"68704824\": OK\r\n");
	memset(usart_wifi_buf, 0, WIFI_BUF_SIZE);
	WifiRecvFlag = 0;
	
	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+CIPMUX=1\r\n");
		vTaskDelay(delay_time_ms);
		uputs(USART_TERMINAL, "AT+CIPMUX=1...\r\n");
	}
	uputs(USART_TERMINAL, "AT+CIPMUX=1: OK\r\n");
	memset(usart_wifi_buf, 0, WIFI_BUF_SIZE);
	WifiRecvFlag = 0;
	
	// while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
	// 	sprintf(msg, "AT+CIPSERVER=1,%d\r\n", BC_CENTER_SERV_PORT);
	// 	uputs(USART_WIFI, msg);
	// 	vTaskDelay(delay_time_ms);
	// 	sprintf(msg, "AT+CIPSERVER=1,%d...\r\n", BC_CENTER_SERV_PORT);
	// 	uputs(USART_TERMINAL, msg);
	// }
	// sprintf(msg, "AT+CIPSERVER=1,%d: OK\r\n", BC_CENTER_SERV_PORT);
	// uputs(USART_TERMINAL, msg);
	// memset(usart_wifi_buf, 0, WIFI_BUF_SIZE);
	// WifiRecvFlag = 0;
	
	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		uputs(USART_WIFI, "AT+CIFSR\r\n");
		vTaskDelay(delay_time_ms);
		uputs(USART_TERMINAL, "AT+CIFSR\r\n");
	}
	uputs(USART_TERMINAL, "AT+CIFSR: OK\r\n");
	// memset(usart_wifi_buf, 0, WIFI_BUF_SIZE);
	WifiRecvFlag = 0;

	tmp_ptr = usart_wifi_buf;
	tmp_ptr = strstr(tmp_ptr, "STAIP,");
	if(!tmp_ptr) {
		uputs(USART_TERMINAL, "Parse IP: Error\r\n");
		return -2;
	}
	tmp_ptr += strlen("STAIP,");
	// tmp_ptr += 1; // at position of "
	tmp_ptr += 1; // at the first number 
	uputs(USART_TERMINAL, tmp_ptr);
	uputs(USART_TERMINAL, "\r\n");
	memset(INADDR_ANY, 0, 16);
	for(i = 0; i < 16;i++) {
		if('.' == tmp_ptr[i] || isdigit(tmp_ptr[i])) {
			INADDR_ANY[i] = tmp_ptr[i]; 
		} else {
			break;
		}
	}
	INADDR_ANY[i] = '\0';
	sprintf(msg, "My IP is %s\r\n", INADDR_ANY);
	uputs(USART_TERMINAL, msg);
	SET_WIFI_USART_STATE(WIFI_USART_STATE_RUNNING);
	
	return 0;
}


void vTcpServerTask(void *pvParameters)
{
	BC_Sockaddr server_addr;
	BC_Sockaddr client_addr;
	sint32_t server_socket = 0;
	sint32_t client_socket;
	uint32_t addr_len = sizeof(BC_Sockaddr);
	sint32_t trans_len = 0;
	
	memset(&server_addr, 0, sizeof(BC_Sockaddr));
	server_addr.sin_family = AF_INET;
	// diff: string not long
	memcpy(server_addr.sin_addr.s_addr, INADDR_ANY, sizeof(INADDR_ANY));
	// diff: host order not net order
	server_addr.sin_port = BC_CENTER_SERV_PORT;
	
	server_socket = BC_Socket(AF_INET, SOCK_STREAM, 0);

	while(GET_WIFI_USART_STATE() == WIFI_USART_STATE_INIT) {
		vTaskDelay(1000);
		// printf("delay task server, sockid=%d\r\n", server_socket);
	}

	if(server_socket < 0) {
		uputs(USART_TERMINAL, "Error: Create socket failed\r\n");
		vTaskDelete(NULL);
		return;
	}
	if(BC_Bind(server_socket,&server_addr,sizeof(server_addr)) != 0) {
        uputs(USART_TERMINAL, "Server Bind Failed!\r\n");
        vTaskDelete(NULL);
		return;
    }
	if (BC_Listen(server_socket, LISTEN_QUEUE) != 0) {
        uputs(USART_TERMINAL, "Server Listen Failed!\r\n"); 
        vTaskDelete(NULL);
		return;
    }
	
	while(TRUE) {
		memset(&client_addr, 0, sizeof(BC_Sockaddr));
		memset(SrvBuf, 0, TASK_BUF_SIZE);
		memset(DstBuf, 0, TASK_BUF_SIZE);
		client_socket = BC_Accept(server_socket, &client_addr,&addr_len);
		WifiRecvFlag &= ~WIFI_MSG_FLAG_GOT_CLI;
        if (client_socket < 0) {
            printf("Server Accept Failed:%d\r\n", client_socket);
            break;
		} else {
			printf("cli_addr:%s\r\n", client_addr.sin_addr.s_addr);
			printf("cli_port:%d\r\n", client_addr.sin_port);
		}
		trans_len = BC_Recv(client_socket, SrvBuf, TASK_BUF_SIZE, 0);
		WifiRecvFlag &= ~WIFI_MSG_FLAG_GOT_IPD;
		if(trans_len <= 0) {
			printf("Server Recv Failed\r\n");
			BC_Close(client_socket);
			continue;
		}
		printf("Recv from %s:%d\r\n", client_addr.sin_addr.s_addr, client_addr.sin_port);
		printf("Msg: #%s#\r\n", SrvBuf);
		printf("Echoing now...\r\n");
		sprintf(DstBuf, "Echo: %s", SrvBuf);
		trans_len = strlen(DstBuf);
		trans_len = BC_Send(client_socket, DstBuf, trans_len, 0);
		vTaskDelay(1000);
		WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
		if(trans_len < 0) {
			printf("Server Send Failed\r\n");
			BC_Close(client_socket);
			continue;
		}
		BC_Close(client_socket);
	}
	
	BC_Close(server_socket);
	vTaskDelay(500);
	WifiRecvFlag &= ~WIFI_MSG_FLAG_GOT_CLOSED;
	vTaskDelete(NULL);
	return;
}

sint32_t BC_Socket(sint32_t family, sint32_t type, sint32_t protocol)
{
	int i;
	for(i = 0; i < BC_MAX_SOCKET_NUM; i++) {
		if(TRUE != sock_data[i].valid) {
			sock_data[i].valid = TRUE;
			return i;
		}
	}
	return -1;
}

