Ansersion/Beecom/test/beecom_test_wifi/FreeRTOS/Demo/CORTEX_STM32F103_Keil/beecom_test_wifi.c
sint32_t BC_Bind(sint32_t sockfd, const BC_Sockaddr * myaddr, uint32_t addrlen)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!myaddr) {
		return -2;
	}
	if(TRUE != sock_data[sockfd].valid) {
		return -3;
	}
	memcpy(&(sock_data[sockfd].addr), myaddr, addrlen);
	return 0;
}

sint32_t BC_Listen(sint32_t sockfd, sint32_t backlog)
{
	uint32_t delay_ms = 50;
	uint32_t fail_count = 0;
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(backlog < 0) {
		return -2;
	}
	if(TRUE != sock_data[sockfd].valid) {
		return -3;
	}
	sock_data[sockfd].backlog = backlog;

	while(!(WifiRecvFlag & WIFI_MSG_FLAG_GENERAL_OK)) {
		sprintf(msg, "AT+CIPSERVER=1,%d\r\n", sock_data[sockfd].addr.sin_port);
		uputs(USART_WIFI, msg);
		vTaskDelay(delay_ms);
		if(fail_count++ > BC_MAX_WIFI_FAIL_COUNT) {
			sprintf(msg, "AT+CIPSERVER=1,%d: Error\r\n", sock_data[sockfd].addr.sin_port);
			uputs(USART_TERMINAL, msg);
			return -4;
		}
	}
	if(sockfd != 0) {
		uputs(USART_TERMINAL, "Error: Only sockfd(LinkNo.)==0 can be server\r\n");
		return -5;
	}
	// sock_data[sockfd].is_server = TRUE;
	WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
	
	return 0;
}

sint32_t BC_Accept(sint32_t sockfd, BC_Sockaddr * cliaddr, uint32_t * addrlen)
{
	BC_SocketData sock_data_tmp;

	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!cliaddr) {
		return -2;
	}
	if(!addrlen) {
		return -3;
	}
	if(TRUE != sock_data[sockfd].valid) {
		return -4;
	}
	// wait for the semphore
	
	k_cliaddr = cliaddr;
	k_addrlen = addrlen;

	while(pdFALSE == xQueueReceive(xQueue0, &sock_data_tmp, 1000/portTICK_RATE_MS)) {
	}
	uputs(USART_WIFI, "AT+CIPSTATUS\r\n");
	while(pdFALSE == xQueueReceive(xQueue0, &sock_data_tmp, 1000/portTICK_RATE_MS)) {
		// uputs(USART_TERMINAL, usart_wifi_buf);
	}
	memcpy(cliaddr, &(sock_data_tmp.addr), sizeof(BC_Sockaddr));
	WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
	WifiRecvFlag &= ~WIFI_MSG_FLAG_GOT_CONNECT;
	
	return 0;
}

sint32_t BC_Connect(sint32_t sockfd, const BC_Sockaddr * servaddr, uint32_t addrlen)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!servaddr) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}

	sprintf(msg, "AT+CIPSTART=%d,\"TCP\",\"%s\",%d", sockfd, servaddr->sin_addr.s_addr, servaddr->sin_port);
	return 0;
}

sint32_t BC_Close(sint32_t sockfd)
{
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!sock_data[sockfd].valid) {
		return -2;
	}
	sprintf(msg, "AT+CIPCLOSE=%d\r\n", sockfd);
	uputs(USART_WIFI, msg);
	// sock_data[sockfd].valid = FALSE;
	return 0;
}

sint32_t BC_Recv(sint32_t sockfd, void * buff, uint32_t nbytes, sint32_t flags)
{
	BC_SocketData sock_data_tmp;
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!buff) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}
	sock_data_tmp.wifi_id = -1;
	while(pdFALSE == xQueueReceive(xQueue0, &sock_data_tmp, 1000/portTICK_RATE_MS)) {
		// TODO:
		// Judge if remote close
	}
	memcpy(SrvBuf, sock_data_tmp.buf, sock_data_tmp.ipd_size);
	// vTaskDelay(1000);
	// printf("recv: got IPD");
	// vTaskDelay(1000);
	printf("recv: wifi_id=%d\r\n", sock_data_tmp.wifi_id);
	// vTaskDelay(1000);
	// printf("recv: %s\r\n", sock_data_tmp.buf);
	// while(1) {
	// 	vTaskDelay(1000);
	// }
	// wait semphore
	// StartReceiveFlag = 1;
	// SET_START_RECV_FLAG(1);
	// while(StartReceiveFlag)
	// 	;
	// read USART_WIFI(in ISA)
	// taskYIELD
	return sock_data_tmp.ipd_size;
}

sint32_t BC_Send(sint32_t sockfd, const void * buff, uint32_t nbytes, sint32_t flags)
{
	static sint32_t i = 0;
	static uint8_t * buf_tmp = NULL;
	if(!ASSERT_SOCK_VALID(sockfd)) {
		return -1;
	}
	if(!buff) {
		return -2;
	}
	if(!sock_data[sockfd].valid) {
		return -3;
	}

	// memset(msg, 0, sizeof(msg));
	
	WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
	sprintf(msg, "AT+CIPSEND=%d,%d\r\n", sockfd, nbytes);
	uputs(USART_WIFI, msg);
	vTaskDelay(1000); // TODO
	WifiRecvFlag &= ~WIFI_MSG_FLAG_GENERAL_OK;
	buf_tmp = (uint8_t *)buff;
	for(i = 0; i < nbytes; i++) {
		USART_SendData(USART_WIFI, buf_tmp[i]);
		while(USART_GetFlagStatus(USART_WIFI,USART_FLAG_TC)!=SET);
	}
	
	return nbytes;
}

sint32_t GET_START_RECV_FLAG(uint32_t * u32F)
{
	if(!xMutexWifiStateFlag) {
		return -1;
	}
	if(!u32F) {
		return -2;
	}
	if(pdTRUE != xSemaphoreTake(xMutexWifiStateFlag, portMAX_DELAY)) {
		return -3;
	}
	*u32F = StartReceiveFlag;
	if(pdTRUE != xSemaphoreGive(xMutexWifiStateFlag)) {
		return -4;
	}
	return 0;
}

sint32_t SET_START_RECV_FLAG(uint32_t u32F)
{
	if(!xMutexWifiStateFlag) {
		return -1;
	}
	if(pdTRUE != xSemaphoreTake(xMutexWifiStateFlag, portMAX_DELAY)) {
		return -3;
	}
	StartReceiveFlag = u32F;
	if(pdTRUE != xSemaphoreGive(xMutexWifiStateFlag)) {
		return -4;
	}
	return 0;
}

sint32_t GET_START_RECV_FLAG_ISR(uint32_t * u32F)
{
	static BaseType_t xHigherPriorityTaskWoken;
	if(!xMutexWifiStateFlag) {
		return -1;
	}
	if(!u32F) {
		return -2;
	}
	if(pdTRUE != xSemaphoreTakeFromISR(xMutexWifiStateFlag, &xHigherPriorityTaskWoken)) {
		return -3;
	}
	*u32F = StartReceiveFlag;
	if(pdTRUE != xSemaphoreGiveFromISR(xMutexWifiStateFlag, &xHigherPriorityTaskWoken)) {
		return -4;
	}
	return 0;
}

sint32_t SET_START_RECV_FLAG_ISR(uint32_t u32F)
{
	static BaseType_t xHigherPriorityTaskWoken;
	if(!xMutexWifiStateFlag) {
		return -1;
	}
	if(pdTRUE != xSemaphoreTakeFromISR(xMutexWifiStateFlag, &xHigherPriorityTaskWoken)) {
		return -3;
	}
	StartReceiveFlag = u32F;
	if(pdTRUE != xSemaphoreGiveFromISR(xMutexWifiStateFlag, &xHigherPriorityTaskWoken)) {
		return -4;
	}
	return 0;
}

sint32_t BC_Atoi(char n)
{
	return n - '0';
}

sint32_t CheckWifiData(uint8_t * buf, uint32_t buf_size, uint8_t * flag, uint32_t flag_size, bool_t is_end_term)
{
	static sint32_t i = 0;
	// static sint32_t j = 0;
	if(buf_size < flag_size) {
		return BC_ERR;
	}
	if(!buf) {
		return BC_ERR;
	}
	if(!flag) {
		return BC_ERR;
	}
	if(is_end_term) {
		for(i = 0; i < flag_size; i++) {
			if(buf[buf_size - flag_size + i] != flag[i]) {
				return BC_ERR;
			}
		}
	} else {
		for(i = 0; i < flag_size; i++) {
			if(buf[i] != flag[i]) {
				return BC_ERR;
			}
		}
	}
	return BC_OK;
}

